/**
 *
 */
package com.qjdchina.pocketsale.commons.enums;

/**
 * 类名:MemberAuthFile
 * 功能:认证资料类型枚举
 * 日期: 2015年10月10日 上午10:58:35
 *
 * @author wangzheng
 * @version 1.0.0
 * @see
 * @since JDK 1.7
 */
public enum MemberAuthFile {

    /**
     * 营业执照正副本
     */
    C10001("C10001"),

    /**
     * 组织机构代码证正副本
     */
    C10002("C10002"),

    /**
     * 税务登记证正副本
     */
    C10003("C10003"),

    /**
     * 品牌授权书、荣誉证书、相关资质证书、特殊行业批准/许可文件
     */
    C10004("C10004"),

    /**
     * 公司章程
     */
    C10005("C10005"),

    /**
     * 企业房产
     */
    C10006("C10006"),

    /**
     * 企业车辆
     */
    C10007("C10007"),

    /**
     * 企业对外投资
     **/
    C10008("C10008"),

    /**
     * 企业征信报告
     **/
    C10009("C10009"),

    /**
     * 公司过往大额供货合同
     */
    C10010("C10010"),

    /**
     * 财务报表
     */
    C10011("C10011"),

    /**
     * 控制人夫妇及大股东身份信息
     **/
    C10012("C10012"),

    /**
     * 控制人结婚证
     */
    C10013("C10013"),

    /**
     * 借款人房产
     */
    C10014("C10014"),

    /**
     * 借款人车辆
     **/
    C10015("C10015"),

    /**
     * 借款人对外投资
     **/
    C10016("C10016"),

    /**
     * 个人征信报告
     */
    C10017("C10017"),

    /**
     * 银行货款结算流水
     */
    C10018("C10018"),

    /**
     * 附加资料
     */
    C10019("C10019");

    private String value;

    private MemberAuthFile(String value) {
        this.value = value;
    }

    public String getValue() {
        return value;
    }
}
